PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p16f1615.inc
;-----Bank8------------------
HIDRVC           EQU  H'040E'
T4TMR            EQU  H'0413'
TMR4             EQU  H'0413'
PR4              EQU  H'0414'
T4PR             EQU  H'0414'
T4CON            EQU  H'0415'
T4HLT            EQU  H'0416'
T4CLKCON         EQU  H'0417'
T4RST            EQU  H'0418'
T6TMR            EQU  H'041A'
TMR6             EQU  H'041A'
PR6              EQU  H'041B'
T6PR             EQU  H'041B'
T6CON            EQU  H'041C'
T6HLT            EQU  H'041D'
T6CLKCON         EQU  H'041E'
T6RST            EQU  H'041F'

;-----Bank9------------------
TMR3L            EQU  H'0493'
TMR3H            EQU  H'0494'
T3CON            EQU  H'0495'
T3GCON           EQU  H'0496'
TMR5L            EQU  H'049A'
TMR5H            EQU  H'049B'
T5CON            EQU  H'049C'
T5GCON           EQU  H'049D'

;-----Bank11------------------
PID1SET          EQU  H'058C'
PID1SETL         EQU  H'058C'
PID1SETH         EQU  H'058D'
PID1IN           EQU  H'058E'
PID1INL          EQU  H'058E'
PID1INH          EQU  H'058F'
PID1K1           EQU  H'0590'
PID1K1L          EQU  H'0590'
PID1K1H          EQU  H'0591'
PID1K2           EQU  H'0592'
PID1K2L          EQU  H'0592'
PID1K2H          EQU  H'0593'
PID1K3           EQU  H'0594'
PID1K3L          EQU  H'0594'
PID1K3H          EQU  H'0595'
PID1OUT          EQU  H'0596'
PID1OUTLL        EQU  H'0596'
PID1OUTLH        EQU  H'0597'
PID1OUTHL        EQU  H'0598'
PID1OUTHH        EQU  H'0599'
PID1OUTU         EQU  H'059A'
PID1Z1           EQU  H'059B'
PID1Z1L          EQU  H'059B'
PID1Z1H          EQU  H'059C'
PID1Z1U          EQU  H'059D'

;-----Bank12------------------
PID1Z2           EQU  H'060C'
PID1Z2L          EQU  H'060C'
PID1Z2H          EQU  H'060D'
PID1Z2U          EQU  H'060E'
PID1ACC          EQU  H'060F'
PID1ACCLL        EQU  H'060F'
PID1ACCLH        EQU  H'0610'
PID1ACCHL        EQU  H'0611'
PID1ACCHH        EQU  H'0612'
PID1ACCU         EQU  H'0613'
PID1CON          EQU  H'0614'
PWM3DCL          EQU  H'0617'
PWM3DCH          EQU  H'0618'
PWM3CON          EQU  H'0619'
PWM4DCL          EQU  H'061A'
PWM4DCH          EQU  H'061B'
PWM4CON          EQU  H'061C'

;-----Bank13------------------
CWG1DBR          EQU  H'0691'
CWG1DBF          EQU  H'0692'
CWG1AS0          EQU  H'0693'
CWG1AS1          EQU  H'0694'
CWG1OCON0        EQU  H'0695'
CWG1CON0         EQU  H'0696'
CWG1CON1         EQU  H'0697'
CWG1CLKCON       EQU  H'0699'
CWG1ISM          EQU  H'069A'

;-----Bank14------------------
WDTCON0          EQU  H'0711'
WDTCON1          EQU  H'0712'
WDTPSL           EQU  H'0713'
WDTPSH           EQU  H'0714'
WDTTMR           EQU  H'0715'
SCANLADR         EQU  H'0718'
SCANLADRL        EQU  H'0718'
SCANLADRH        EQU  H'0719'
SCANHADR         EQU  H'071A'
SCANHADRL        EQU  H'071A'
SCANHADRH        EQU  H'071B'
SCANCON0         EQU  H'071C'
SCANTRIG         EQU  H'071D'

;-----Bank15------------------
CRCDAT           EQU  H'0791'
CRCDATL          EQU  H'0791'
CRCDATH          EQU  H'0792'
CRCACC           EQU  H'0793'
CRCACCL          EQU  H'0793'
CRCACCH          EQU  H'0794'
CRCSHIFT         EQU  H'0795'
CRCSHIFTL        EQU  H'0795'
CRCSHIFTH        EQU  H'0796'
CRCXOR           EQU  H'0797'
CRCXORL          EQU  H'0797'
CRCXORH          EQU  H'0798'
CRCCON0          EQU  H'0799'
CRCCON1          EQU  H'079A'

;-----Bank16------------------
AT1RES           EQU  H'080C'
AT1RESL          EQU  H'080C'
AT1RESH          EQU  H'080D'
AT1MISS          EQU  H'080E'
AT1MISSL         EQU  H'080E'
AT1MISSH         EQU  H'080F'
AT1PER           EQU  H'0810'
AT1PERL          EQU  H'0810'
AT1PERH          EQU  H'0811'
AT1PHS           EQU  H'0812'
AT1PHSL          EQU  H'0812'
AT1PHSH          EQU  H'0813'
AT1CON0          EQU  H'0814'
AT1CON1          EQU  H'0815'
AT1IR0           EQU  H'0816'
AT1IE0           EQU  H'0817'
AT1IR1           EQU  H'0818'
AT1IE1           EQU  H'0819'
AT1STPT          EQU  H'081A'
AT1STPTL         EQU  H'081A'
AT1STPTH         EQU  H'081B'
AT1ERR           EQU  H'081C'
AT1ERRL          EQU  H'081C'
AT1ERRH          EQU  H'081D'

;-----Bank17------------------
AT1CLK           EQU  H'088C'
AT1SIG           EQU  H'088D'
AT1CSEL1         EQU  H'088E'
AT1CC1           EQU  H'088F'
AT1CC1L          EQU  H'088F'
AT1CC1H          EQU  H'0890'
AT1CCON1         EQU  H'0891'
AT1CSEL2         EQU  H'0892'
AT1CC2           EQU  H'0893'
AT1CC2L          EQU  H'0893'
AT1CC2H          EQU  H'0894'
AT1CCON2         EQU  H'0895'
AT1CSEL3         EQU  H'0896'
AT1CC3           EQU  H'0897'
AT1CC3L          EQU  H'0897'
AT1CC3H          EQU  H'0898'
AT1CCON3         EQU  H'0899'

;-----Bank27------------------
SMT1TMR          EQU  H'0D8C'
SMT1TMRL         EQU  H'0D8C'
SMT1TMRH         EQU  H'0D8D'
SMT1TMRU         EQU  H'0D8E'
SMT1CPR          EQU  H'0D8F'
SMT1CPRL         EQU  H'0D8F'
SMT1CPRH         EQU  H'0D90'
SMT1CPRU         EQU  H'0D91'
SMT1CPW          EQU  H'0D92'
SMT1CPWL         EQU  H'0D92'
SMT1CPWH         EQU  H'0D93'
SMT1CPWU         EQU  H'0D94'
SMT1PR           EQU  H'0D95'
SMT1PRL          EQU  H'0D95'
SMT1PRH          EQU  H'0D96'
SMT1PRU          EQU  H'0D97'
SMT1CON0         EQU  H'0D98'
SMT1CON1         EQU  H'0D99'
SMT1STAT         EQU  H'0D9A'
SMT1CLK          EQU  H'0D9B'
SMT1SIG          EQU  H'0D9C'
SMT1WIN          EQU  H'0D9D'
SMT2TMR          EQU  H'0D9E'
SMT2TMRL         EQU  H'0D9E'
SMT2TMRH         EQU  H'0D9F'
SMT2TMRU         EQU  H'0DA0'
SMT2CPR          EQU  H'0DA1'
SMT2CPRL         EQU  H'0DA1'
SMT2CPRH         EQU  H'0DA2'
SMT2CPRU         EQU  H'0DA3'
SMT2CPW          EQU  H'0DA4'
SMT2CPWL         EQU  H'0DA4'
SMT2CPWH         EQU  H'0DA5'
SMT2CPWU         EQU  H'0DA6'
SMT2PR           EQU  H'0DA7'
SMT2PRL          EQU  H'0DA7'
SMT2PRH          EQU  H'0DA8'
SMT2PRU          EQU  H'0DA9'
SMT2CON0         EQU  H'0DAA'
SMT2CON1         EQU  H'0DAB'
SMT2STAT         EQU  H'0DAC'
SMT2CLK          EQU  H'0DAD'
SMT2SIG          EQU  H'0DAE'
SMT2WIN          EQU  H'0DAF'

;-----Bank28------------------
PPSLOCK          EQU  H'0E0F'
INTPPS           EQU  H'0E10'
T0CKIPPS         EQU  H'0E11'
T1CKIPPS         EQU  H'0E12'
T1GPPS           EQU  H'0E13'
CCP1PPS          EQU  H'0E14'
CCP2PPS          EQU  H'0E15'
ATINPPS          EQU  H'0E16'
CWGINPPS         EQU  H'0E17'
T2PPS            EQU  H'0E18'
T3CKIPPS         EQU  H'0E19'
T3GPPS           EQU  H'0E1A'
T4PPS            EQU  H'0E1B'
T5CKIPPS         EQU  H'0E1C'
T5GPPS           EQU  H'0E1D'
T6PPS            EQU  H'0E1E'
ATCC1PPS         EQU  H'0E1F'
SSPCLKPPS        EQU  H'0E20'
SSPDATPPS        EQU  H'0E21'
SSPSSPPS         EQU  H'0E22'
ATCC2PPS         EQU  H'0E23'
RXPPS            EQU  H'0E24'
CKPPS            EQU  H'0E25'
SMT1SIGPPS       EQU  H'0E26'
SMT1WINPPS       EQU  H'0E27'
CLCIN0PPS        EQU  H'0E28'
CLCIN1PPS        EQU  H'0E29'
CLCIN2PPS        EQU  H'0E2A'
CLCIN3PPS        EQU  H'0E2B'
SMT2SIGPPS       EQU  H'0E2C'
SMT2WINPPS       EQU  H'0E2D'
ATCC3PPS         EQU  H'0E2E'

;-----Bank29------------------
RA0PPS           EQU  H'0E90'
RA1PPS           EQU  H'0E91'
RA2PPS           EQU  H'0E92'
RA4PPS           EQU  H'0E94'
RA5PPS           EQU  H'0E95'
RC0PPS           EQU  H'0EA0'
RC1PPS           EQU  H'0EA1'
RC2PPS           EQU  H'0EA2'
RC3PPS           EQU  H'0EA3'
RC4PPS           EQU  H'0EA4'
RC5PPS           EQU  H'0EA5'

;-----Bank30------------------
CLCDATA          EQU  H'0F0F'
CLC1CON          EQU  H'0F10'
CLC1POL          EQU  H'0F11'
CLC1SEL0         EQU  H'0F12'
CLC1SEL1         EQU  H'0F13'
CLC1SEL2         EQU  H'0F14'
CLC1SEL3         EQU  H'0F15'
CLC1GLS0         EQU  H'0F16'
CLC1GLS1         EQU  H'0F17'
CLC1GLS2         EQU  H'0F18'
CLC1GLS3         EQU  H'0F19'
CLC2CON          EQU  H'0F1A'
CLC2POL          EQU  H'0F1B'
CLC2SEL0         EQU  H'0F1C'
CLC2SEL1         EQU  H'0F1D'
CLC2SEL2         EQU  H'0F1E'
CLC2SEL3         EQU  H'0F1F'
CLC2GLS0         EQU  H'0F20'
CLC2GLS1         EQU  H'0F21'
CLC2GLS2         EQU  H'0F22'
CLC2GLS3         EQU  H'0F23'
CLC3CON          EQU  H'0F24'
CLC3POL          EQU  H'0F25'
CLC3SEL0         EQU  H'0F26'
CLC3SEL1         EQU  H'0F27'
CLC3SEL2         EQU  H'0F28'
CLC3SEL3         EQU  H'0F29'
CLC3GLS0         EQU  H'0F2A'
CLC3GLS1         EQU  H'0F2B'
CLC3GLS2         EQU  H'0F2C'
CLC3GLS3         EQU  H'0F2D'
CLC4CON          EQU  H'0F2E'
CLC4POL          EQU  H'0F2F'
CLC4SEL0         EQU  H'0F30'
CLC4SEL1         EQU  H'0F31'
CLC4SEL2         EQU  H'0F32'
CLC4SEL3         EQU  H'0F33'
CLC4GLS0         EQU  H'0F34'
CLC4GLS1         EQU  H'0F35'
CLC4GLS2         EQU  H'0F36'
CLC4GLS3         EQU  H'0F37'

;-----Bank31------------------
STATUS_SHAD      EQU  H'0FE4'
WREG_SHAD        EQU  H'0FE5'
BSR_SHAD         EQU  H'0FE6'
PCLATH_SHAD      EQU  H'0FE7'
FSR0L_SHAD       EQU  H'0FE8'
FSR0H_SHAD       EQU  H'0FE9'
FSR1L_SHAD       EQU  H'0FEA'
FSR1H_SHAD       EQU  H'0FEB'
STKPTR           EQU  H'0FED'
TOSL             EQU  H'0FEE'
TOSH             EQU  H'0FEF'

;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NOT_PD           EQU  H'0003'
NOT_TO           EQU  H'0004'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'


;----- INTCON Bits -----------------------------------------------------
IOCIF            EQU  H'0000'
INTF             EQU  H'0001'
TMR0IF           EQU  H'0002'
IOCIE            EQU  H'0003'
INTE             EQU  H'0004'
TMR0IE           EQU  H'0005'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'

T0IF             EQU  H'0002'
T0IE             EQU  H'0005'


