PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p16f1615.inc
T6CS0            EQU  H'0000'
T6CS1            EQU  H'0001'
T6CS2            EQU  H'0002'
T6CS3            EQU  H'0003'


;----- T6RST Bits -----------------------------------------------------
RSEL0            EQU  H'0000'
RSEL1            EQU  H'0001'
RSEL2            EQU  H'0002'
RSEL3            EQU  H'0003'


T6RSEL0          EQU  H'0000'
T6RSEL1          EQU  H'0001'
T6RSEL2          EQU  H'0002'
T6RSEL3          EQU  H'0003'


;----- T3CON Bits -----------------------------------------------------
TMR3ON           EQU  H'0000'
T3SYNC           EQU  H'0002'

T3CKSP0          EQU  H'0004'
T3CKPS1          EQU  H'0005'
TMR3CS0          EQU  H'0006'
TMR3CS1          EQU  H'0007'


;----- T3GCON Bits -----------------------------------------------------
T3GVAL           EQU  H'0002'
T3GGO_NOT_DONE   EQU  H'0003'
T3GSPM           EQU  H'0004'
T3GTM            EQU  H'0005'
T3GPOL           EQU  H'0006'
TMR3GE           EQU  H'0007'

T3GSS0           EQU  H'0000'
T3GSS1           EQU  H'0001'


;----- T5CON Bits -----------------------------------------------------
TMR5ON           EQU  H'0000'
T5SYNC           EQU  H'0002'

T5CKPS0          EQU  H'0004'
T5CKPS1          EQU  H'0005'
TMR5CS0          EQU  H'0006'
TMR5CS1          EQU  H'0007'


;----- T5GCON Bits -----------------------------------------------------
T5GVAL           EQU  H'0002'
T5GGO_NOT_DONE   EQU  H'0003'
T5GSPM           EQU  H'0004'
T5GTM            EQU  H'0005'
T5GPOL           EQU  H'0006'
TMR5GE           EQU  H'0007'

T5GSS0           EQU  H'0000'
T5GSS1           EQU  H'0001'


;----- PID1SETL Bits -----------------------------------------------------
PID1SET0         EQU  H'0000'
PID1SET1         EQU  H'0001'
PID1SET2         EQU  H'0002'
PID1SET3         EQU  H'0003'
PID1SET4         EQU  H'0004'
PID1SET5         EQU  H'0005'
PID1SET6         EQU  H'0006'
PID1SET7         EQU  H'0007'

SET0             EQU  H'0000'
SET1             EQU  H'0001'
SET2             EQU  H'0002'
SET3             EQU  H'0003'
SET4             EQU  H'0004'
SET5             EQU  H'0005'
SET6             EQU  H'0006'
SET7             EQU  H'0007'


;----- PID1SETH Bits -----------------------------------------------------
PID1SET8         EQU  H'0000'
PID1SET9         EQU  H'0001'
PID1SET10        EQU  H'0002'
PID1SET11        EQU  H'0003'
PID1SET12        EQU  H'0004'
PID1SET13        EQU  H'0005'
PID1SET14        EQU  H'0006'
PID1SET15        EQU  H'0007'

SET8             EQU  H'0000'
SET9             EQU  H'0001'
SET10            EQU  H'0002'
SET11            EQU  H'0003'
SET12            EQU  H'0004'
SET13            EQU  H'0005'
SET14            EQU  H'0006'
SET15            EQU  H'0007'


;----- PID1INL Bits -----------------------------------------------------
PID1IN0          EQU  H'0000'
PID1IN1          EQU  H'0001'
PID1IN2          EQU  H'0002'
PID1IN3          EQU  H'0003'
PID1IN4          EQU  H'0004'
PID1IN5          EQU  H'0005'
PID1IN6          EQU  H'0006'
PID1IN7          EQU  H'0007'

IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'
IN4              EQU  H'0004'
IN5              EQU  H'0005'
IN6              EQU  H'0006'
IN7              EQU  H'0007'


;----- PID1INH Bits -----------------------------------------------------
PID1IN8          EQU  H'0000'
PID1IN9          EQU  H'0001'
PID1IN10         EQU  H'0002'
PID1IN11         EQU  H'0003'
PID1IN12         EQU  H'0004'
PID1IN13         EQU  H'0005'
PID1IN14         EQU  H'0006'
PID1IN15         EQU  H'0007'

IN8              EQU  H'0000'
IN9              EQU  H'0001'
IN10             EQU  H'0002'
IN11             EQU  H'0003'
IN12             EQU  H'0004'
IN13             EQU  H'0005'
IN14             EQU  H'0006'
IN15             EQU  H'0007'


;----- PID1K1L Bits -----------------------------------------------------
PID1K10          EQU  H'0000'
PID1K11          EQU  H'0001'
PID1K12          EQU  H'0002'
PID1K13          EQU  H'0003'
PID1K14          EQU  H'0004'
PID1K15          EQU  H'0005'
PID1K16          EQU  H'0006'
PID1K17          EQU  H'0007'

K10              EQU  H'0000'
K11              EQU  H'0001'
K12              EQU  H'0002'
K13              EQU  H'0003'
K14              EQU  H'0004'
K15              EQU  H'0005'
K16              EQU  H'0006'
K17              EQU  H'0007'


;----- PID1K1H Bits -----------------------------------------------------
PID1K18          EQU  H'0000'
PID1K19          EQU  H'0001'
PID1K110         EQU  H'0002'
PID1K111         EQU  H'0003'
PID1K112         EQU  H'0004'
PID1K113         EQU  H'0005'
PID1K114         EQU  H'0006'
PID1K115         EQU  H'0007'

K18              EQU  H'0000'
K19              EQU  H'0001'
K110             EQU  H'0002'
K111             EQU  H'0003'
K112             EQU  H'0004'
K113             EQU  H'0005'
K114             EQU  H'0006'
K115             EQU  H'0007'


;----- PID1K2L Bits -----------------------------------------------------
PID1K20          EQU  H'0000'
PID1K21          EQU  H'0001'
PID1K22          EQU  H'0002'
PID1K23          EQU  H'0003'
PID1K24          EQU  H'0004'
PID1K25          EQU  H'0005'
PID1K26          EQU  H'0006'
PID1K27          EQU  H'0007'

K20              EQU  H'0000'
K21              EQU  H'0001'
K22              EQU  H'0002'
K23              EQU  H'0003'
K24              EQU  H'0004'
K25              EQU  H'0005'
K26              EQU  H'0006'
K27              EQU  H'0007'


;----- PID1K2H Bits -----------------------------------------------------
PID1K28          EQU  H'0000'
PID1K29          EQU  H'0001'
PID1K210         EQU  H'0002'
PID1K211         EQU  H'0003'
PID1K212         EQU  H'0004'
PID1K213         EQU  H'0005'
PID1K214         EQU  H'0006'
PID1K215         EQU  H'0007'

K28              EQU  H'0000'
K29              EQU  H'0001'
K210             EQU  H'0002'
K211             EQU  H'0003'
K212             EQU  H'0004'
K213             EQU  H'0005'
K214             EQU  H'0006'
K215             EQU  H'0007'


;----- PID1K3L Bits -----------------------------------------------------
PID1K30          EQU  H'0000'
PID1K31          EQU  H'0001'
PID1K32          EQU  H'0002'
PID1K33          EQU  H'0003'
PID1K34          EQU  H'0004'
PID1K35          EQU  H'0005'
PID1K36          EQU  H'0006'
PID1K37          EQU  H'0007'

K30              EQU  H'0000'
K31              EQU  H'0001'
K32              EQU  H'0002'
K33              EQU  H'0003'
K34              EQU  H'0004'
K35              EQU  H'0005'
K36              EQU  H'0006'
K37              EQU  H'0007'


